In [8]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [9]:
#Series

s = pd.Series([1, 3, 5, np.nan, 6, 8])
print(s)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [10]:
# DataFrame

dates = pd.date_range("20130101", periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df = pd.DataFrame(np.random.randn(6, 4), index = dates, columns = list('ABCD'))
df

                   A         B         C         D
2013-01-01 -1.177623  0.383000  0.389913 -0.159494
2013-01-02 -0.907756 -1.128909  1.514503  2.421727
2013-01-03 -0.239853  0.375598 -0.420292  0.424453
2013-01-04 -2.472128 -0.258387  1.269705  1.056230
2013-01-05  1.127979 -0.780842  0.838529  0.782536
2013-01-06 -0.538597 -0.720856  0.039703 -1.019469

In [12]:
# Dict of objects

df2 = pd.DataFrame({"A": 1, 
                    "B": pd.Timestamp("20130102"), 
                    "C": pd.Series(1, index = list(range(4)), dtype = "float"), 
                    "D": np.array([3] * 4, dtype = "int32"), 
                    "E": pd.Categorical(["test", "train", "test", "train"]), 
                    "F": "foo"})
df2

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

In [13]:
# dtypes
df2.dtypes

A             int64
B    datetime64[ns]
C           float64
D             int32
E          category
F            object
dtype: object

In [14]:
# View first five rows

df.head()

                   A         B         C         D
2013-01-01 -1.177623  0.383000  0.389913 -0.159494
2013-01-02 -0.907756 -1.128909  1.514503  2.421727
2013-01-03 -0.239853  0.375598 -0.420292  0.424453
2013-01-04 -2.472128 -0.258387  1.269705  1.056230
2013-01-05  1.127979 -0.780842  0.838529  0.782536

In [15]:
# View last three rows

df.tail(3)

                   A         B         C         D
2013-01-04 -2.472128 -0.258387  1.269705  1.056230
2013-01-05  1.127979 -0.780842  0.838529  0.782536
2013-01-06 -0.538597 -0.720856  0.039703 -1.019469

In [16]:
# View index of DataFrame

df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [18]:
# View columns of DataFrame

df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
# View values of DataFrame

df.values

array([[-1.177623  ,  0.38300043,  0.38991297, -0.15949364],
       [-0.90775556, -1.12890942,  1.51450299,  2.42172701],
       [-0.23985327,  0.37559834, -0.420292  ,  0.42445299],
       [-2.47212763, -0.25838746,  1.26970505,  1.05622955],
       [ 1.12797906, -0.78084151,  0.83852861,  0.78253624],
       [-0.5385968 , -0.72085598,  0.03970336, -1.01946868]])

In [19]:
# Statistics Summary

df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.701330 -0.355066  0.605343  0.584331
std    1.182456  0.632753  0.740353  1.165247
min   -2.472128 -1.128909 -0.420292 -1.019469
25%   -1.110156 -0.765845  0.127256 -0.013507
50%   -0.723176 -0.489622  0.614221  0.603495
75%   -0.314539  0.217102  1.161911  0.987806
max    1.127979  0.383000  1.514503  2.421727

In [20]:
# Transposing the data

df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.177623   -0.907756   -0.239853   -2.472128    1.127979   -0.538597
B    0.383000   -1.128909    0.375598   -0.258387   -0.780842   -0.720856
C    0.389913    1.514503   -0.420292    1.269705    0.838529    0.039703
D   -0.159494    2.421727    0.424453    1.056230    0.782536   -1.019469

In [21]:
# Sorting by an axis

df.sort_index(axis = 1, ascending = False)

                   D         C         B         A
2013-01-01 -0.159494  0.389913  0.383000 -1.177623
2013-01-02  2.421727  1.514503 -1.128909 -0.907756
2013-01-03  0.424453 -0.420292  0.375598 -0.239853
2013-01-04  1.056230  1.269705 -0.258387 -2.472128
2013-01-05  0.782536  0.838529 -0.780842  1.127979
2013-01-06 -1.019469  0.039703 -0.720856 -0.538597

In [22]:
# Sort by Values

df.sort_values(by = "B")

                   A         B         C         D
2013-01-02 -0.907756 -1.128909  1.514503  2.421727
2013-01-05  1.127979 -0.780842  0.838529  0.782536
2013-01-06 -0.538597 -0.720856  0.039703 -1.019469
2013-01-04 -2.472128 -0.258387  1.269705  1.056230
2013-01-03 -0.239853  0.375598 -0.420292  0.424453
2013-01-01 -1.177623  0.383000  0.389913 -0.159494

In [23]:
# Select data of A

df["A"]

2013-01-01   -1.177623
2013-01-02   -0.907756
2013-01-03   -0.239853
2013-01-04   -2.472128
2013-01-05    1.127979
2013-01-06   -0.538597
Freq: D, Name: A, dtype: float64

In [24]:
# Slices the rows

df[0:3]

                   A         B         C         D
2013-01-01 -1.177623  0.383000  0.389913 -0.159494
2013-01-02 -0.907756 -1.128909  1.514503  2.421727
2013-01-03 -0.239853  0.375598 -0.420292  0.424453

In [25]:
# Slices the rows

df["20130102": "20130104"]

                   A         B         C         D
2013-01-02 -0.907756 -1.128909  1.514503  2.421727
2013-01-03 -0.239853  0.375598 -0.420292  0.424453
2013-01-04 -2.472128 -0.258387  1.269705  1.056230

In [26]:
# Cross Section

df.loc[dates[0]]

A   -1.177623
B    0.383000
C    0.389913
D   -0.159494
Name: 2013-01-01 00:00:00, dtype: float64

In [27]:
# multi-axis by label

df.loc[:, ["A", "B"]]

                   A         B
2013-01-01 -1.177623  0.383000
2013-01-02 -0.907756 -1.128909
2013-01-03 -0.239853  0.375598
2013-01-04 -2.472128 -0.258387
2013-01-05  1.127979 -0.780842
2013-01-06 -0.538597 -0.720856

In [28]:
# Both endpoints included

df.loc[dates[1:4], ["A", "B"]]

                   A         B
2013-01-02 -0.907756 -1.128909
2013-01-03 -0.239853  0.375598
2013-01-04 -2.472128 -0.258387

In [29]:
# Scalar Value

df.loc[dates[1], "C"]

1.5145029885943695

In [30]:
# Row 4 data

df.iloc[3]

A   -2.472128
B   -0.258387
C    1.269705
D    1.056230
Name: 2013-01-04 00:00:00, dtype: float64

In [31]:
# integer slicing

df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -2.472128 -0.258387
2013-01-05  1.127979 -0.780842

In [32]:
# integer position

df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.907756  1.514503
2013-01-03 -0.239853 -0.420292
2013-01-05  1.127979  0.838529

In [33]:
# slocing rows explicitly

df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.907756 -1.128909  1.514503  2.421727
2013-01-03 -0.239853  0.375598 -0.420292  0.424453

In [34]:
# slicing columns explicitly

df.iloc[:, 1:3]

                   B         C
2013-01-01  0.383000  0.389913
2013-01-02 -1.128909  1.514503
2013-01-03  0.375598 -0.420292
2013-01-04 -0.258387  1.269705
2013-01-05 -0.780842  0.838529
2013-01-06 -0.720856  0.039703

In [35]:
# getting value explicitly

df.iloc[1, 1]

-1.1289094230733607

### Boolean Indexing

In [36]:
df[df.A > 0]

                   A         B         C         D
2013-01-05  1.127979 -0.780842  0.838529  0.782536

In [37]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.383000  0.389913       NaN
2013-01-02       NaN       NaN  1.514503  2.421727
2013-01-03       NaN  0.375598       NaN  0.424453
2013-01-04       NaN       NaN  1.269705  1.056230
2013-01-05  1.127979       NaN  0.838529  0.782536
2013-01-06       NaN       NaN  0.039703       NaN

In [38]:
# isin method

df2 = df.copy()
df2["E"] = ["one", "one", "two", "three", "four", "three"]
df2

                   A         B         C         D      E
2013-01-01 -1.177623  0.383000  0.389913 -0.159494    one
2013-01-02 -0.907756 -1.128909  1.514503  2.421727    one
2013-01-03 -0.239853  0.375598 -0.420292  0.424453    two
2013-01-04 -2.472128 -0.258387  1.269705  1.056230  three
2013-01-05  1.127979 -0.780842  0.838529  0.782536   four
2013-01-06 -0.538597 -0.720856  0.039703 -1.019469  three

In [39]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03 -0.239853  0.375598 -0.420292  0.424453   two
2013-01-05  1.127979 -0.780842  0.838529  0.782536  four

In [40]:
# Setting

s1 = pd.Series([1, 2, 3, 4, 5, 6], index = pd.date_range("20130102", periods = 6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [42]:
df["F"] = s1
df

                   A         B         C         D    F
2013-01-01 -1.177623  0.383000  0.389913 -0.159494  NaN
2013-01-02 -0.907756 -1.128909  1.514503  2.421727  1.0
2013-01-03 -0.239853  0.375598 -0.420292  0.424453  2.0
2013-01-04 -2.472128 -0.258387  1.269705  1.056230  3.0
2013-01-05  1.127979 -0.780842  0.838529  0.782536  4.0
2013-01-06 -0.538597 -0.720856  0.039703 -1.019469  5.0

In [43]:
# Setting values by label
df.at[dates[0], "A"] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.383000  0.389913 -0.159494  NaN
2013-01-02 -0.907756 -1.128909  1.514503  2.421727  1.0
2013-01-03 -0.239853  0.375598 -0.420292  0.424453  2.0
2013-01-04 -2.472128 -0.258387  1.269705  1.056230  3.0
2013-01-05  1.127979 -0.780842  0.838529  0.782536  4.0
2013-01-06 -0.538597 -0.720856  0.039703 -1.019469  5.0

In [44]:
# setting values by position
df.iat[0, 1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000  0.389913 -0.159494  NaN
2013-01-02 -0.907756 -1.128909  1.514503  2.421727  1.0
2013-01-03 -0.239853  0.375598 -0.420292  0.424453  2.0
2013-01-04 -2.472128 -0.258387  1.269705  1.056230  3.0
2013-01-05  1.127979 -0.780842  0.838529  0.782536  4.0
2013-01-06 -0.538597 -0.720856  0.039703 -1.019469  5.0

In [46]:
# setting by assigning with a numpy array

df.loc[:, "D"] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.389913  5  NaN
2013-01-02 -0.907756 -1.128909  1.514503  5  1.0
2013-01-03 -0.239853  0.375598 -0.420292  5  2.0
2013-01-04 -2.472128 -0.258387  1.269705  5  3.0
2013-01-05  1.127979 -0.780842  0.838529  5  4.0
2013-01-06 -0.538597 -0.720856  0.039703  5  5.0

In [47]:
# where operation

df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.389913 -5  NaN
2013-01-02 -0.907756 -1.128909 -1.514503 -5 -1.0
2013-01-03 -0.239853 -0.375598 -0.420292 -5 -2.0
2013-01-04 -2.472128 -0.258387 -1.269705 -5 -3.0
2013-01-05 -1.127979 -0.780842 -0.838529 -5 -4.0
2013-01-06 -0.538597 -0.720856 -0.039703 -5 -5.0

### Missing data

In [48]:
df1 = df.reindex(index = dates[0:4], columns = list(df.columns) + ["E"])
df1.loc[dates[0]:dates[1], "E"] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.389913  5  NaN  1.0
2013-01-02 -0.907756 -1.128909  1.514503  5  1.0  1.0
2013-01-03 -0.239853  0.375598 -0.420292  5  2.0  NaN
2013-01-04 -2.472128 -0.258387  1.269705  5  3.0  NaN

In [49]:
# drop missing data

df1.dropna(how = "any")

                   A         B         C  D    F    E
2013-01-02 -0.907756 -1.128909  1.514503  5  1.0  1.0

In [50]:
# filling missing data

df1.fillna(value = 5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.389913  5  5.0  1.0
2013-01-02 -0.907756 -1.128909  1.514503  5  1.0  1.0
2013-01-03 -0.239853  0.375598 -0.420292  5  2.0  5.0
2013-01-04 -2.472128 -0.258387  1.269705  5  3.0  5.0

In [51]:
# boolean mask

pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [52]:
df.mean()

A   -0.505059
B   -0.418899
C    0.605343
D    5.000000
F    3.000000
dtype: float64

In [53]:
df.mean(1)

2013-01-01    1.347478
2013-01-02    1.095568
2013-01-03    1.343091
2013-01-04    1.307838
2013-01-05    2.037133
2013-01-06    1.756050
Freq: D, dtype: float64

In [54]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index = dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [55]:
df.sub(s, axis = "index")

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -1.239853 -0.624402 -1.420292  4.0  1.0
2013-01-04 -5.472128 -3.258387 -1.730295  2.0  0.0
2013-01-05 -3.872021 -5.780842 -4.161471  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

- numpy.cumsum() function is used when we want to compute the cumulative sum of array elements over a given axis.

In [57]:
# Apply functions

df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  0.389913   5   NaN
2013-01-02 -0.907756 -1.128909  1.904416  10   1.0
2013-01-03 -1.147609 -0.753311  1.484124  15   3.0
2013-01-04 -3.619736 -1.011699  2.753829  20   6.0
2013-01-05 -2.491757 -1.792540  3.592358  25  10.0
2013-01-06 -3.030354 -2.513396  3.632061  30  15.0

In [58]:
df.apply(lambda x: x.max() - x.min())

A    3.600107
B    1.504508
C    1.934795
D    0.000000
F    4.000000
dtype: float64

In [59]:
df.apply(lambda x: x.max() - x.min(), axis = "index")

A    3.600107
B    1.504508
C    1.934795
D    0.000000
F    4.000000
dtype: float64

##### Histogramming

In [60]:
s = pd.Series(np.random.randint(0, 7, size = 10))
s

0    1
1    4
2    4
3    1
4    2
5    2
6    3
7    2
8    0
9    1
dtype: int64

In [61]:
# counting values
s.value_counts()

1    3
2    3
4    2
3    1
0    1
dtype: int64

#### String Methods

In [62]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

### Merge

In [63]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -1.149973 -0.403156 -0.639385  1.275703
1 -0.067767  0.858766  0.174659 -0.639569
2  1.055020 -0.338808 -0.211700  0.623542
3  0.541958 -1.364599  0.701768  1.143068
4 -0.127854  0.202291 -0.644246 -0.868865
5 -1.339924 -1.514255  0.225337 -0.606716
6  0.889809 -0.249850 -0.412407  0.518233
7 -1.452057  0.489928 -1.353062  0.735968
8 -0.148288  1.043998 -0.043532  0.571969
9  0.584491  0.734297  0.149759  1.112394

In [64]:
## break into pieces
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -1.149973 -0.403156 -0.639385  1.275703
 1 -0.067767  0.858766  0.174659 -0.639569
 2  1.055020 -0.338808 -0.211700  0.623542,
           0         1         2         3
 3  0.541958 -1.364599  0.701768  1.143068
 4 -0.127854  0.202291 -0.644246 -0.868865
 5 -1.339924 -1.514255  0.225337 -0.606716
 6  0.889809 -0.249850 -0.412407  0.518233,
           0         1         2         3
 7 -1.452057  0.489928 -1.353062  0.735968
 8 -0.148288  1.043998 -0.043532  0.571969
 9  0.584491  0.734297  0.149759  1.112394]

In [65]:
# concat

pd.concat(pieces)

          0         1         2         3
0 -1.149973 -0.403156 -0.639385  1.275703
1 -0.067767  0.858766  0.174659 -0.639569
2  1.055020 -0.338808 -0.211700  0.623542
3  0.541958 -1.364599  0.701768  1.143068
4 -0.127854  0.202291 -0.644246 -0.868865
5 -1.339924 -1.514255  0.225337 -0.606716
6  0.889809 -0.249850 -0.412407  0.518233
7 -1.452057  0.489928 -1.353062  0.735968
8 -0.148288  1.043998 -0.043532  0.571969
9  0.584491  0.734297  0.149759  1.112394

In [66]:
# Join

left  = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})

In [67]:
left

   key  lval
0  foo     1
1  foo     2

In [68]:
right

   key  rval
0  foo     4
1  foo     5

In [69]:
pd.merge(left, right, on = "key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

#### Apend

In [70]:
df = pd.DataFrame(np.random.randn(8, 4), columns = ["A", "B", "C", "D"])
df

          A         B         C         D
0 -1.457291 -0.489299  0.873675  0.075246
1 -0.417229  1.223382  1.665338 -0.159669
2  2.226290 -0.267046  1.523931  0.382652
3  0.248079 -1.902944 -1.045693 -0.454356
4  0.567342  0.297295 -2.177857  1.382523
5 -0.965078  0.189373 -0.827152 -1.236070
6  0.645758  1.319156 -2.241773  2.172056
7 -1.226322  0.610466 -1.603665  0.518907

In [71]:
s = df.iloc[3]
s

A    0.248079
B   -1.902944
C   -1.045693
D   -0.454356
Name: 3, dtype: float64

In [72]:
df.append(s, ignore_index = True)

          A         B         C         D
0 -1.457291 -0.489299  0.873675  0.075246
1 -0.417229  1.223382  1.665338 -0.159669
2  2.226290 -0.267046  1.523931  0.382652
3  0.248079 -1.902944 -1.045693 -0.454356
4  0.567342  0.297295 -2.177857  1.382523
5 -0.965078  0.189373 -0.827152 -1.236070
6  0.645758  1.319156 -2.241773  2.172056
7 -1.226322  0.610466 -1.603665  0.518907
8  0.248079 -1.902944 -1.045693 -0.454356

In [73]:
## Creating a DataFrame
dates = pd.date_range("20130101", periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [74]:
## Creating a DataFrame
df1 = pd.DataFrame(np.random.randn(6, 4), index = dates, columns = list("ABCD"))
df1

                   A         B         C         D
2013-01-01  0.430195 -2.198280  1.238253  0.560726
2013-01-02 -3.057773 -1.295618  0.336128 -0.949711
2013-01-03 -1.163121 -0.457827  0.604257  0.550326
2013-01-04 -0.625539  0.217172 -0.455661 -0.295304
2013-01-05  0.621762  0.815106 -1.538552 -0.706917
2013-01-06  0.543429 -1.647512 -2.896439 -0.237583

#### Grouping

In [75]:
df = pd.DataFrame({"A": ["foo", "bar", "foo", "bar",
                         "foo", "bar", "foo", "foo"],
                   "B": ["one", "one", "two", "three",
                         "two", "two", "one", "three"],
                   "C": np.random.randn(8),
                   "D": np.random.randn(8)})
df

     A      B         C         D
0  foo    one -1.832389  0.074143
1  bar    one  1.132387 -2.217857
2  foo    two  0.585635  0.182076
3  bar  three -0.102557  0.504993
4  foo    two -0.432710  0.968652
5  bar    two -0.910459 -0.154881
6  foo    one -0.646258  2.648606
7  foo  three  0.243338  0.751725

In [76]:
# grouping

df.groupby("A").sum()

            C         D
A
bar  0.119371 -1.867745
foo -2.082384  4.625203

In [77]:
# groupby hierarchical index

df.groupby(["A", "B"]).sum()

                  C         D
A   B
bar one    1.132387 -2.217857
    three -0.102557  0.504993
    two   -0.910459 -0.154881
foo one   -2.478647  2.722749
    three  0.243338  0.751725
    two    0.152925  1.150728

#### Reshapping

In [78]:
# Stack

tuples = list(zip(*[["bar", "bar", "baz", "baz",
                    "foo", "foo", "qux", "qux"],
                    ["one", "two", "one", "two",
                     "one", "two", "one", "two"]]))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [79]:
index = pd.MultiIndex.from_tuples(tuples, names = ["first", "second"])
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [80]:
df = pd.DataFrame(np.random.randn(8, 2), index = index, columns = ["A", "B"])
df

                     A         B
first second
bar   one     0.604792 -0.547064
      two     0.708773 -0.476979
baz   one     1.341371  0.117539
      two     0.152302  2.475480
foo   one    -0.352314  0.968644
      two    -0.858702  1.639071
qux   one    -0.540067  0.917571
      two    -0.675676 -0.156830